Repository: fillpdfservice/fillpdf-service
Catalog: sites/all/modules/textimage/po/*.po
Languages: es

source: Implements an image recognition captcha.
es: Proporciona un sistema de reconocimiento de imágenes Captcha.

source: Image library not available. Textimage needs the GD library extension to be installed. Please install GD.
es: No se encuentra la biblioteca de gestión de imágenes. Textimage necesita que la biblioteca de extensión GD esté instalada. Por favor, instale GD.

source: Your image library does not seem to have TrueType font support. Textimage will work, but will use the default inbuilt font.
es: Aparentemente, la biblioteca de gestión de imágenes instalada no permite el empleo de fuentes TrueType. Textimage funcionará, pero utilizando la fuente predeterminada que incluye.

source: The current font path is invalid. The default font will be used.
es: La ruta actual de las fuentes no es válida. Se utilizará la fuente predeterminada.

source: The current images path is invalid. No images will be used.
es: La ruta actual de las imágenes de fondo no es válida. No se utilizarán imágenes.

source: Fonts settings
es: Opciones de fuente

source: Use only Uppercase
es: Utilizar sólo mayúsculas

source: TrueType Fonts Path
es: Ruta de las fuentes TrueType

source: Location of the directory where the Truetype (.ttf) fonts are stored. If you do not provide any fonts, the module will use the default font for text. Relative paths will be resolved relative to the Drupal installation directory.
es: Ubicación del directorio en el que se encuentran las fuentes TrueType (.ttf). Si no se indica, el módulo creará el texto con la fuente predeterminada. Las rutas relativas se traducirán utilizando como referencia el directorio en el que Drupal esté instalado.

source: Font Size
es: Tamaño de la fuente

source: Font size of Captcha text (in pixels).
es: Tamaño de la fuente del texto Captcha (en píxeles).

source: Character Spacing
es: Espacio entre caracteres

source: Sets the kerning between letters in Captcha. Higher numbers indicate more spacing.
es: Determina la distancia entre las letras del texto Captcha. A mayor número más distancia.

source: Character Jiggle
es: Desplazamiento de caracteres

source: Sets the amount of up and down movement in the Captcha letters. Higher numbers indicate more jiggling.
es: Determina cuánto se desplazarán hacia arriba y hacia abajo las letras del texto Captcha. A mayor número más desplazamiento.

source: Character Rotation
es: Rotación de caracteres

source: Sets the amount of rotation in the Captcha letters (in degrees, only works with non-default fonts).
es: Determina el ángulo de rotación de las letras que componen el texto Captcha (en grados, sólo se aplica a las fuentes no predeterminadas).

source: Character Size Adjustment
es: Ajuste del tamaño de caracteres

source: Sets the amount of variation in size between the different letters in the Captcha (in pixels).
es: Determina cuán diferentes serán los tamaños de las diferentes letras que componen el texto Captcha (en píxeles).

source: Image settings
es: Opciones de imagen

source: Background Images Path
es: Ruta de las imágenes de fondo

source: Location of the directory where the background images are stored. If you do not provide a directory, solid colors will be used. Relative paths will be resolved relative to the Drupal installation directory.
es: Ubicación del directorio en el que se encuentran las imágenes de fondo. Si no se indica, el módulo utilizará colores sólidos. Las rutas relativas se traducirán utilizando como referencia el directorio en el que Drupal esté instalado.

source: Image Noise (pixels)
es: Ruido de la imagen (píxeles)

source: Sets the amount of noise (random pixels) in the Captcha image. Higher numbers indicate more noise.
es: Determina la cantidad de ruido (píxeles aleatorios) que aparecerán en la imagen Captcha. A mayor número más ruido.

source: Image Noise (lines)
es: Ruido de la imagen (líneas)

source: Sets the amount of noise (random lines) in the Captcha image. Higher numbers indicate more noise.
es: Determina la cantidad de ruido (líneas aleatorias) que aparecerán en la imagen Captcha. A mayor número más ruido.

source: Image Margin
es: Margen de la imagen

source: Set a distance between the Captcha letters and the edges of the image.
es: Determina la distancia entre las letras del texto Captcha y los bordes de la imagen.

source: Image and font information
es: Información de imágenes y fuente

source: Number of fonts found:
es: Número de fuentes encontradas:

source: Number of background images found:
es: Número de imágenes de fondo encontradas:

source: GD Version:
es: Versión de GD:

source: FreeType Support:
es: Compatibilidad con FreeType:

source: The entered font path is invalid
es: La ruta de las fuentes indicada no es válida.

source: The entered image path is invalid
es: La ruta de las imágenes indicada no es válida.

source: The value for %field must be a number.
es: El valor del campo %field debe ser numérico.

source: Captcha Validation
es: Validación Captcha

source: Please type in the letters/numbers that are shown in the image above.
es: Por favor, introduzca las letras y/o números mostrados en la imagen anterior.

source: Captcha Image: you will need to recognize the text in it.
es: Imagen Captcha: es necesario que reconozca el texto mostrado.

source: The image verification code you entered is incorrect.
es: El código de verificación de la imagen que ha introducido no es correcto.

source: access textimages
es: acceso a imágenes Captcha
